/datum/job/civilian/synthetic
	disp_title = JOB_SYNTH_RU
	supervisors = "исполняющий обязанности командующего офицера"
	entry_message_body = "Вы <a href="+WIKI_PLACEHOLDER+"'>Синтетик!</a> К вам предъявляются более высокие требования, и вы обязаны соблюдать не только Правила сервера, но и Законы Морпехов и Правила синтетика. Невыполнение этого требования может привести к исключению из белого списка. Ваша основная задача — оказывать поддержку и помощь всем департаментам и персоналу ККМП на борту. Кроме того, статус синтетика дает вам знания во всех областях и специализациях, возможных на борту судна. Как синтетик, вы подчиняетесь исполняющему обязанности командира. Особые обстоятельства могут это изменить!"
