/datum/job/logistics/requisition
	disp_title = JOB_CHIEF_REQUISITION_RU
	entry_message_body = "<a href='"+WIKI_PLACEHOLDER+"'>Ваша работа</a> заключается в том, \
	чтобы распределять поставки среди морских пехотинцев, включая оружейные обвесы. \
	Ваши грузовые техники могут вам помочь, но последнее слово в вашем отделе за вами. \
	Убедитесь, что они не бездельничают. Хотя вы можете запросить документы на поставки, \
	не ругайтесь с Морпехами лишний раз и не насаливайте им, если не хотите получить отставку. \
	Счастливый корабль — это хорошо функционирующий корабль."
