GLOBAL_LIST_INIT(ai_names, file2list("strings/ai.txt"))
GLOBAL_LIST_INIT(first_names_male, file2list("strings/first_male.txt"))
GLOBAL_LIST_INIT(first_names_female, file2list("strings/first_female.txt"))
GLOBAL_LIST_INIT(last_names, file2list("strings/last.txt"))
GLOBAL_LIST_INIT(clown_names, file2list("strings/clown.txt"))
GLOBAL_LIST_INIT(operation_titles, file2list("strings/operation_title.txt"))
GLOBAL_LIST_INIT(operation_prefixes, file2list("strings/operation_prefix.txt"))
GLOBAL_LIST_INIT(operation_postfixes, file2list("strings/operation_postfix.txt"))

GLOBAL_LIST_INIT(verbs, file2list("strings/verbs.txt"))
//loaded on startup because of "
//would include in rsc if ' was used


GLOBAL_LIST_INIT(first_names_male_clf, list("Алан", "Джек", "Бил", "Джонатан", "Джон", "Широ", "Гарет", "Кларк", "Сэм", "Лионель", "Аарон", "Чарли", "Скотт", "Уинстон", "Айдан", "Эллис", "Мэйсон", "Уэсли", "Николас", "Кэлвин", "Нишикава", "Хирото", "Чиба", "Оучи", "Фурусе", "Такаги", "Оба", "Кишимото"))
GLOBAL_LIST_INIT(first_names_female_clf, list("Эмма", "Аделинн", "Мэри", "Хейли", "Челси", "Лекси", "Арья", "Алисия", "Села", "Эмбер", "Хизер", "Майра", "Хайди", "Шарлотта", "Оливия", "Лидия", "Тиа", "Рико", "Ари", "Мачида", "Уэки", "Михара", "Нода"))
GLOBAL_LIST_INIT(last_names_clf, list("Хокинс", "Рикшоу", "Эллиот", "Бильярд", "Купер", "Фокс", "Барлоу", "Барроуз", "Стюарт", "Морган", "Грин", "Стоун", "Берр", "Хант", "Юко", "Гешин", "Таканибу", "Тетсузан", "Томоми", "Боккай", "Такеси"))

GLOBAL_LIST_INIT(first_names_male_colonist, list("Алан", "Джек", "Бил", "Джонатан", "Джон", "Широ", "Гарет", "Кларк", "Сэм", "Лионель", "Аарон", "Чарли", "Скотт", "Уинстон", "Айден", "Эллис", "Мэйсон", "Уэсли", "Николас", "Кэлвин", "Нишикава", "Хирото", "Чиба", "Оучи", "Фурусе", "Такаги", "Оба", "Кишимото"))
GLOBAL_LIST_INIT(first_names_female_colonist, list("Эмма", "Аделинн", "Мэри", "Хейли", "Челси", "Лекси", "Арья", "Алисия", "Села", "Эмбер", "Хизер", "Майра", "Хайди", "Шарлотта", "Эшли", "Рэйвен", "Тори", "Энн", "Мэдисон", "Оливия", "Лидия", "Тиа", "Рико", "Ари", "Мачида", "Уэки", "Михара", "Нода"))
GLOBAL_LIST_INIT(last_names_colonist, list("Хокинс", "Рикшоу", "Эллиот", "Бильярд", "Купер", "Фокс", "Барлоу", "Барроуз", "Стюарт", "Морган", "Грин", "Стоун", "Титан", "Кроу", "Кранц", "Патийо", "Дриггерс", "Берр", "Хант", "Юко", "Гешин", "Таканибу", "Тетсузан", "Томоми", "Боккай", "Такеси"))

GLOBAL_LIST_INIT(first_names_male_upp, list("Бадай", "Монгкеемур", "Алексей", "Андрей", "Артём", "Виктор", "Сянгай", "Иван", "Чобан", "Олег", "Даян", "Таги", "Бату", "Арик", "Орда", "Газан", "Бала", "Гао", "Жан", "Рен", "Хоу", "Сюэ", "Серафим", "Лука", "Су", "Дьёрдь", "Иштван", "Михай", "Владимир", "Александр", "Фёдор", "Бходар", "Казем", "Лукаш", "Милогост", "Радогост", "Униегост", "Хостирад", "Хостимил", "Хостисвит", "Лубгост", "Гостислав", "Всеслав", "Богумер", "Бронислав", "Честьмер", "Добыслав", "Хорислав", "Яромер", "Мирослав", "Мечислав", "Радомер", "Станий", "Станислав", "Велимер", "Войслав"))
GLOBAL_LIST_INIT(first_names_female_upp, list("Алтани", "Цирина", "Анастасия", "Саран", "Вэй", "Оксана", "Рен", "Свена", "Татьяна", "Ярослава", "Изабелла", "Ката", "Кристина", "Мируна", "Флори", "Люсия", "Аница", "Ли", "Иму", "Алона", "Сяу-Ли", "Сяолин", "Эрхонг", "Баська", "Анжела", "Анжелина", "Анджа", "Анкица", "Биляна", "Бисер", "Бистра", "Блага", "Благица", "Благородна", "Верка", "Владица", "Деница", "Живка", "Злата", "Ягода", "Летка", "Люпка", "Мила", "Мирьяна", "Мирка", "Рада", "Радмила", "Славица", "Славка", "Снежана", "Стойна", "Убавка", "Яромир", "Мщевой", "Субислав", "Святополк", "Чжи-Сун", "Чхэён", "Чхэвон", "Сэром", "Соён", "Чихон", "Хаён"))
GLOBAL_LIST_INIT(last_names_upp, list("Азар", "Богда", "Барс", "Голо", "Дава", "Хан", "Нойка", "Барбу", "Жу", "Ива", "Михай", "Каспу", "Бела", "Мельник", "Василь", "Халкович", "Прока", "Зайтуц", "Аркос", "Кубат", "Крал", "Вольф", "Сюнь", "Цзя", "Бахонь", "Ван", "Цзи", "Сян", "Чжан", "Мэй", "Ма", "Ким", "Ин", "Ри", "Пак", "Чон", "Бэк", "Квон", "Хван", "Ро", "Ли", "Сон"))

GLOBAL_LIST_INIT(first_names_male_pmc, list("Оуэн", "Лука", "Нельсон", "Брэнсон", "Тайсон", "Лео", "Брайант", "Кобе", "Рохан", "Райли", "Айден", "Ватасе", "Эгава", "Хисакава", "Коиде", "Реми", "Марсьяль", "Магнус", "Хейко", "Леннард"))
GLOBAL_LIST_INIT(first_names_female_pmc, list("Мэдисон", "Джессика", "Анна", "Джульетта", "Оливия", "Леа", "Диана", "Каори", "Беатрис", "Райли", "Эми", "Нацуэ", "Юми", "Айко", "Фудзико", "Дженнифер", "Эшли", "Мэри", "Хитоми", "Лиза"))
GLOBAL_LIST_INIT(last_names_pmc, list("Бейтс", "Шоу", "Хансен", "Блэк", "Чемберс", "Холл", "Гибсон", "Вайс", "Уоллер", "Бёртон", "Бакин", "Рохан", "Наомичи", "Якумо", "Ёсай", "Галлахер", "Хайлс", "Бурдон", "Штрассман", "Палау"))

GLOBAL_LIST_INIT(first_names_male_gladiator, list("Август", "Максимус", "Октавий", "Септимус", "Тит", "Брут", "Цезарь", "Юстиниан"))
GLOBAL_LIST_INIT(first_names_female_gladiator, list("Элия", "Аквила", "Цецилия", "Камилла", "Клавдия", "Флавия", "Мартина", "Феодора"))

GLOBAL_LIST_INIT(first_names_male_dutch, list("Раймонд", "Джесси", "Джек", "Джон", "Сэм", "Аарон", "Чарли", "Эллис", "Ник", "Фрэнсис", "Луис"))
GLOBAL_LIST_INIT(first_names_female_dutch, list("Челси", "Мира", "Джессика", "Кэтрин", "Элиза", "Эмма", "Эшли", "Энни", "Алисия", "Миранда", "Эллен"))

GLOBAL_LIST_INIT(monkey_names, list("Абу", "Альдо", "Беар", "Бинго", "Клайд", "Кристал", "Гордо", "Джордж", "Коко", "Марсель", "Ним", "Рафик", "Спайк", "Банан", "Башмачок", "Бабблз", "Смайли", "Уинстон", "Пун-пун"))

GLOBAL_LIST_INIT(weapon_surnames, list("Адзе", "Топор", "Багх Наха", "Бо", "Бола", "Лук", "Лучник", "Пушка", "Карабин", "Цестус", "Дубина", "Кулеврина", "Кинжал", "Дао", "Дерринджер", "Дха", "Дусак", "Эмейци", "Фальшион", "Веер", "Флисса", "Перчатка", "Молот", "Алебарда", "Аркебуза", "Топорик", "Хвандо", "Катар", "Кампелан", "Кастет", "Копьё", "Лансер", "Ларим", "Мадуву", "Булава", "Мару", "Маузер", "Мессер", "Мины", "Мубукаэ", "Ньепел", "Онагр", "Пата", "Пика", "Таран", "Сабля", "Сэкс", "Шамшир", "Серп", "Праща", "Копьё", "Копья", "Посох", "Меч", "Текко"))

GLOBAL_LIST_INIT(pred_names, list("Ну'коир", "За-ай'стба", "Ау'стбеп", "Гихн'тилл", "Ау'стбеп", "Туд'таб", "Гехту-а", "У-дан'дчу", "Буа'дту", "А'йтейн", "Ю-тхуахтоу", "Йон'та", "Пан'теиат", "Бан'ти", "Ве'тиад", "Га-айтеит", "А'ках", "Дачанде"))
GLOBAL_LIST_INIT(pred_last_names, list("Тха'джо", "Ба'йтуи", "Тва'дтей", "Вах'ка"))
