/datum/job/command/auxiliary_officer
	disp_title = JOB_AUXILIARY_OFFICER_RU
	entry_message_body = "<a href='"+WIKI_PLACEHOLDER+"'>Ваша работа заключается в наблюдении за</a> командой ангара, офицерами разведки, инженерным отделом и отделом снабжения. У вас много обязанностей и мест где нужно крутиться, но ваши подчиненные в основном полагаются на себя. Помогайте, где можете, и убедитесь, что командный состав уверен, что отделы поддержки работают с максимальной эффективностью."

/datum/timelock/auxiliary
	name = "Auxiliary Roles"
