//Intelligence Officer
/datum/job/command/intel
	disp_title = JOB_INTEL_RU
	supervisors = "офицером поддержки"
	//gear_preset = "USCM Intelligence Officer (IO) (Cryo)"
	entry_message_body = "<a href='"+WIKI_PLACEHOLDER+"'>Ваша задача — помогать Морпехам собирать разведданные, связанные с текущей операцией, чтобы лучше информировать командование о сопротивлении. Вы отвечаете за сбор любых дисков с данными, папок и заметок, которые вы можете найти на операционных площадках, и расшифровываете их, чтобы предоставить ККМП дополнительные ресурсы."
