/datum/chem_property/positive/antitoxic
	description = "Поглощает и нейтрализует токсичные химические вещества в кровотоке, обеспечивая их безопасное выведение из организма."

/datum/chem_property/positive/anticorrosive
	description = "Ускоряет деление клеток вокруг поврежденных участков, чтобы заменить утраченную ткань. Чрезмерное употребление может вызвать апоптоз."

/datum/chem_property/positive/neogenetic
	description = "Регенерирует разорванные мембраны, что приводит к восстановлению поврежденных органических тканей. Высокие концентрации могут разъедать клеточные мембраны."

/datum/chem_property/positive/repairing
	description = "Восстанавливает кибернетические органы, используя ######## свойство ######## элемента."

/datum/chem_property/positive/hemogenic
	description = "Увеличивает выработку эритроцитов в костном мозге, что приводит к полицитемии – повышенному объему эритроцитов в крови."

/datum/chem_property/positive/hemostatic
	description = "Значительно улучшает естественную способность крови свертываться и останавливать кровотечение за счет увеличения выработки и эффективности тромбоцитов. Передозировка приведет к сильному свертыванию крови, что приведет к серьезному повреждению тканей."

/datum/chem_property/positive/nervestimulating
	description = "Увеличивает скорость связи нейронов через синапсы, что приводит к улучшению времени реакции, осознанности и мышечного контроля."

/datum/chem_property/positive/musclestimulating
	description = "Стимулирует нервно-мышечные соединения, увеличивая силу мышечных сокращений, что приводит к увеличению силы. Высокие дозы могут истощить сердечную мышцу."

/datum/chem_property/positive/painkilling
	description = "Связывается с опиоидными рецепторами в головном и спинном мозге, уменьшая количество болевых сигналов, посылаемых в мозг."

/datum/chem_property/positive/hepatopeutic
	description = "Лечит разрушенные гепатоциты и поврежденные ткани печени, восстанавливая функции органа."

/datum/chem_property/positive/nephropeutic
	description = "Заживляет поврежденные и разрушенные подоциты в почках, восстанавливая функции органов."

/datum/chem_property/positive/pneumopeutic
	description = "Восстанавливает интерстициальную ткань альвеол, восстанавливая дыхательные функции легких."

/datum/chem_property/positive/oculopeutic
	description = "Восстанавливает сенсорные возможности фоторецепторных клеток глаз, возвращая утраченное зрение."

/datum/chem_property/positive/cardiopeutic
	description = "Регенерирует поврежденные кардиомиоциты и восстанавливает правильный сердечный цикл и функциональность сердца."

/datum/chem_property/positive/neuropeutic
	description = "Восстанавливает поврежденные и сломанные нейроны центральной нервной системы, восстанавливая функциональность мозга."

/datum/chem_property/positive/bonemending
	description = "Быстро увеличивает выработку остеобластов и хондробластов, а также ускоряет процесс эндохондрального окостенения. Это позволяет сломанной костной ткани повторно срастаться и быстро восстанавливаться, если кость расположена правильно. Передозировка может привести к аномальному росту костной структуры и оказать неблагоприятное воздействие на структуру скелета."

/datum/chem_property/positive/fluxing
	description = "Разжижает крупные кристаллические и металлические структуры при температуре тела и позволяет им мигрировать и выводиться через кожу."

/datum/chem_property/positive/neurocryogenic
	description = "Вызывает временное замораживание всех неврологических процессов и клеточного дыхания в мозге. Это позволяет мозгу сохраняться в течение длительного периода времени."

/datum/chem_property/positive/antiparasitic
	description = "Антимикробное свойство, направленное против паразитических патогенов в организме, нарушая их рост и потенциально убивая их."

/datum/chem_property/positive/organstabilize
	description = "Стабилизирует повреждение внутренних органов, купируя симптомы внутреннего повреждения."

/datum/chem_property/positive/electrogenetic
	description = "Стимулирует сердечную мышцу при воздействии электрического тока и обеспечивает общее заживление. Полезен для перезапуска сердца в сочетании с дефибриллятором."

/datum/chem_property/positive/defibrillating
	description = "Вызывает электрохимическую реакцию в сердечных мышцах, заставляя сердце продолжать работу. Может вызвать нерегулярный сердечный ритм."

/datum/chem_property/positive/hyperdensificating
	description = "Заставляет мышцы и кости становиться сверхплотными, обеспечивая превосходную устойчивость костей к переломам."

/datum/chem_property/positive/neuroshielding
	description = "Защищает мозг от неврологических повреждений, вызванных токсинами."

/datum/chem_property/positive/antiaddictive
	description = "Останавливает всякую тягу организма к вызывающим привыкание химическим веществам."

/datum/chem_property/positive/fire/fueling
	description = "Химическое вещество можно сжигать как топливо, увеличивая время горения химического пожара. Однако это также несколько снижает интенсивность нагрева."

/datum/chem_property/positive/fire/oxidizing
	description = "Химическое вещество окисляется, увеличивая интенсивность химических пожаров. Однако топливо из-за этого сгорает немного быстрее."

/datum/chem_property/positive/fire/flowing
	description = "Химическое вещество противоположно вязкому и имеет тенденцию разливаться повсюду. Вероятно, это можно было бы использовать для расширения радиуса химического пожара."

/datum/chem_property/positive/explosive
	description = "Химическое вещество очень взрывоопасно. Не зажигайте. Будьте осторожны при обращении, чувствительность зависит от порога передозировки, что может привести к самопроизвольной детонации."

//properties for CAS matrixes
/datum/chem_property/positive/photosensitive
	description = "Реагирует на любое количество света. Может быть полезно для создания светочувствительных объектов. Небезопасно принимать."

/datum/chem_property/positive/crystallization
	description = "Химическая структура химического вещества формируется в линзе. пропуская свет шире, сохраняя при этом фокус. Небезопасно принимать."

//properties with combat uses
/datum/chem_property/positive/disrupting
	description = "Нарушает определенные неврологические процессы, связанные с общением у животных."

/datum/chem_property/positive/neutralizing
	description = "Нейтрализует некоторые химически активные химические вещества и плазму при контакте. Небезопасно вводить внутривенно."

//PROPERTY_DISABLED (in random generation)
/datum/chem_property/positive/cardiostabilizing
	description = "Стабилизирует сердечный цикл при шоке."

/datum/chem_property/positive/aiding
	description = "Исправляет генетические дефекты, уродства и инвалидность."

/datum/chem_property/positive/oxygenating
	description = "Лечит кислородное голодание, улучшая способность эритроцитов поглощать кислород и увеличивая потребление кислорода."

/datum/chem_property/positive/anticarcinogenic
	description = "Устраняет генетические повреждения в клетках, подвергшихся воздействию канцерогенов."

/datum/chem_property/positive/regulating
	description = "Химическое вещество регулирует собственный метаболизм, любое передозированное количество превращается в сахар."

/datum/chem_property/positive/firepenetrating
	description = "Придает химическому веществу уникальную, аномальную химию горения, заставляя пламя вступать в реакцию с огнестойким материалом и уничтожать его."
