//Ordnance Technician
/datum/job/logistics/otech
	disp_title = JOB_ORDNANCE_TECH_RU
	supervisors = "главным инженером"
	entry_message_body = "<a href='"+WIKI_PLACEHOLDER+"'>Ваша задача</a> — поддерживать целостность оружия, \
	боеприпасов и оборудования ККМП, включая орбитальную пушку. Вы можете использовать мастерскую в ангаре левого борта, \
	чтобы создавать новое вооружение для морпехов. Однако вы остаетесь одной из самых гибких ролей на корабле \
	и можете получать другие разнорабочие задания от своего руководства."
