//Military Police
/datum/job/command/police
	disp_title = JOB_POLICE_RU
	entry_message_body = "<a href='"+WIKI_PLACEHOLDER+"'>Вы</a> придерживаетесь более высоких стандартов и \
	обязаны соблюдать не только правила сервера, но и <a href="+LAW_PLACEHOLDER+"'>Законы Морпехов</a>. \
	Невыполнение этого требования может привести к джобану и бану на сервере. \
	Ваша главная задача — поддерживать мир и стабильность на борту корабля. Морпехи могут стать \
	буйными после нескольких недель криосна! Кроме того, на вас возложена задача обеспечения безопасности \
	высокопоставленного персонала, включая командный состав. Обеспечьте их безопасность!"
