//BANDAMARINES - Translate
/datum/law/capital_law
	brig_time = PERMABRIG_SENTENCE
	special_punishment = "Понижение в должности или казнь и прекращение действия ID"

/datum/law/capital_law/attempted_murder
	name = "Покушение на убийство"
	desc = "Неудачная попытка убить человека. Доказательства показывают, что арестованный явно пытался убить кого-то со злым умыслом, но не смог этого сделать."

/datum/law/capital_law/murder
	name = "Убийство или несанкционированная казнь"
	desc = "Убийство со злым умыслом. Это касается и Синтетических юнитов. Казни разрешены только в соответствии с процедурой казни."

/datum/law/capital_law/desertion
	name = "Дезертирство"
	desc = "Отказ от выполнения обязанностей, предусмотренных должностью, или самовольное оставление поста без намерения вернуться. (Отступление с планеты при прорыве ФОБ не является дезертирством, отказ вернуться по приказу - является)"

/datum/law/capital_law/sedition
	name = "Подстрекательство"
	desc = "Совершать действия или отказываться выполнять приказы, направленные на свержение или узурпацию законной командной структуры."

/datum/law/capital_law/jailbreak_escape
	name = "Побег"
	desc = "Побег, помощь в побеге, попытки сбежать или быть умышленно и сознательно сбежавшим"

/datum/law/capital_law/crimes_against_humanity
	name = "Преступления против человечности"
	desc = "Участвовать в действиях, которые нарушают права человека или являются ужасными поступками против людей. Примеры: пытки, каннибализм и принудительное заражение лярвами ксеноморфов."
