//BANDAMARINES - Translate
/datum/law/minor_law/contraband
	name = "Контрабанда"
	desc = "Наличие предметов или оружия из зоны операции, не разрешенных лицом со званием Оруж.Серж или выше."
	special_punishment = "Конфискация контрабанды"
	brig_time = 7.5

/datum/law/minor_law/damage_to_government_property
	name = "Повреждение государственного имущества"
	desc = "Повреждение корабля или внесение любых несанкционированных изменений в него, как указано в Стандартных Операционных Процедурах на незначительном уровне, например, разбивание окна или повреждение стены."
	special_punishment = "Ремонт"
	brig_time = 7.5

/datum/law/minor_law/insubordination
	name = "Неподчинение"
	desc = "Неисполнение законного приказа вышестоящего, который не адресован лично вам. Кроме того, неуважение к лицу более высокого ранга или положения, которое не является офицером."
	brig_time = 7.5

/datum/law/minor_law/interference
	name = "Вмешательство"
	desc = "Вмешательство в арест без злого умысла помешать законному аресту, например, блокирование пути или помощь кому-то встать."
	brig_time = 7.5

/datum/law/minor_law/trespassing
	name = "Незаконное проникновение"
	desc = "Несанкционированный доступ в область, к которой у человека нет доступа, или без одобрения лица с доступом."
	special_punishment = "Эскорт наружу"
	brig_time = 7.5

/datum/law/minor_law/listening_bugs
	name = "Несанкционированное использование прослушивающего устройства"
	desc = "Использование прослушивающего устройства в нарушение СОП в общественном месте, таком как спортзал."
	special_punishment = "Конфискация прослушивающего устройства"
	brig_time = 7.5

/datum/law/minor_law/disrespect
	name = "Неуважение к вышестоящему офицеру"
	desc = "Использование оскорбительных прозвищ или прямое неуважительное отношение к кому-либо из офицеров более высокого ранга или положения"
	brig_time = 10

/datum/law/minor_law/failure_to_follow_procedure
	name = "Несоблюдение процедуры"
	desc = "Несоблюдение правил, изложенных в Стандартных Операционных Процедурах."
	special_punishment = "Конфискация оборудования"
	brig_time = 10

/datum/law/minor_law/intoxication
	name = "Опьянение"
	desc = "Употребление алкоголя или других веществ, таких как алкоголь или галлюциногенные наркотики, что приводит к ухудшению выполнения служебных обязанностей."
	brig_time = 10

/datum/law/minor_law/theft
	name = "Кража"
	desc = "Изъятие предметов (или имущества) у другого человека или сущности без их явного разрешения или удержание предметов, которые были изъяты без разрешения. Это включает перенос раздатчиков из зон департамента без разрешения."
	special_punishment = "Возврат украденного предмета"
	brig_time = 10

/datum/law/minor_law/false_testimony
	name = "Ложные показания"
	desc = "Умышленная и добровольная ложь перед ВП или уполномоченным офицером во время юридического расследования с намерением нарушить данное расследование."
	brig_time = 5
