//BANDAMARINES - Translate
/datum/law/optional_law/minor_unruly
	name = "Мелкое нарушение порядка в заключении"
	desc = "Создание мелких беспорядков, находясь в бриге и под арестом. Нарушение порядка считается мелким нарушением закона. Это может быть добавлено к любому обвинению"
	brig_time = 7.5

/datum/law/optional_law/aiding
	name = "Помощь и подстрекательство"
	desc = "Помощь другим в совершении преступления, прямо или косвенно, или поощрение их к его совершению."
	brig_time = 10
	special_punishment = "Так же, как и обвиняемый"

/datum/law/optional_law/resisting_arrest
	name = "Сопротивление аресту"
	desc = "Сопротивление законному аресту или обыску со стороны офицера военной полиции."
	brig_time = 10

/datum/law/optional_law/resisting_search
	name = "Сопротивление обыску"
	desc = "Сопротивление законному обыску от офицера Военной Полиции."
	brig_time = 5

/datum/law/optional_law/major_unruly
	name = "Крупное нарушение порядка в заключении"
	desc = "Создание крупных нарушений порядка, находясь в бриге и под арестом. Нарушение порядка считается крупным нарушением закона. Это может быть добавлено к любому обвинению."
	brig_time = 15
